In [3]:
import re
df9 = {}
with open('Downloads/MicrobiomeMetadataDictionary.csv') as file:
    righe = file.readlines()

for riga in righe:
    m = re.search("(.+),$", riga)
    if m:
        tabella = {}
        df9[m.group(1)] = tabella
    m = re.search("(.+),(.+)$", riga)
    if m:
        tabella[m.group(1)] = m.group(2)
    m = re.search("^,$", riga)

df9

{'CollectionMet': {'0': 'Contents', '1': 'Scraping'},
 'Diet': {'0': 'LFPP',
  '1': 'Western',
  '2': 'CARBR',
  '3': 'FATR',
  '4': 'Suckling',
  '5': 'Human'},
 'Donor': {'0': 'HMouseLFPP',
  '1': 'CONVR',
  '2': 'Human',
  '3': 'Fresh',
  '4': 'Frozen',
  '5': 'HMouseWestern',
  '6': 'CONVD'},
 'Sex': {'0': 'Male', '1': 'Female'},
 'Source': {'0': 'Cecum1',
  '1': 'Cecum2',
  '10': 'SI9',
  '11': 'Stomach',
  '12': 'Cecum',
  '2': 'Colon1',
  '3': 'Colon2',
  '4': 'Feces',
  '5': 'SI1',
  '6': 'SI13',
  '7': 'SI15',
  '8': 'SI2',
  '9': 'SI5'}}

In [4]:
testo = '"BRCA2-001","ENST00000380152.7","11986","3418aa","ENSP00000369497"," Protein coding","CCDS9344","P51587","-","TSL:5GENCODE basicAPPRIS P1"'

In [5]:
testo

'"BRCA2-001","ENST00000380152.7","11986","3418aa","ENSP00000369497"," Protein coding","CCDS9344","P51587","-","TSL:5GENCODE basicAPPRIS P1"'

In [33]:
m = re.search("ENST\d+.*EN(SP(\d+))", testo)

In [34]:
m.group(0)

'ENST00000380152.7","11986","3418aa","ENSP00000369497'

In [35]:
m.group(1)

'00000369497'

In [32]:
m.group(2)

'00000369497'

In [28]:
re.findall("ENST\d+", testo)

['ENST00000380152']

In [37]:
l = [0]
for a in range(5):
    l.append(l[a] + 1)
l

[0, 1, 2, 3, 4, 5]

In [38]:
p = [0]

In [41]:
list(range( 5 + 1))

[0, 1, 2, 3, 4, 5]

In [56]:
import numpy as np
import random
import functools
import operator

In [58]:
functools.reduce(+, [ np.random.rand() * random.choice([1, -1]) for i in range(10)], 0)

SyntaxError: invalid syntax (<ipython-input-58-a76cd39bf699>, line 1)

In [55]:
functools?

In [59]:
[ np.random.rand() * random.choice([1, -1]) for i in range(10)]

[-0.2795779043601063,
 0.28756048169441284,
 -0.49455980536686994,
 -0.5870483978004142,
 0.6244333876401676,
 -0.7629487669682049,
 0.24662262625453613,
 -0.011667595158466049,
 -0.7981889275607419,
 0.14801556608172894]

In [60]:
a = 0
lista = [ 0 ]
for x in [ np.random.rand() * random.choice([1, -1]) for i in range(10)]:
    a += x
    lista.append(a)
lista

[0,
 0.3392441741168496,
 0.4828191337912926,
 -0.2537163562501322,
 0.27529531603090884,
 -0.2844215011927743,
 0.6569638343555384,
 1.248874127750506,
 1.196125924016358,
 1.3943871868839985,
 1.6077920211061318]

In [62]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [63]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [64]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [65]:
pd.merge(df1, df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [73]:
prova = pd.merge(df1, df2, left_index=True, right_index=True)
prova

  employee_x        group employee_y  hire_date
0        Bob   Accounting       Lisa       2004
1       Jake  Engineering        Bob       2008
2       Lisa  Engineering       Jake       2012
3        Sue           HR        Sue       2014

In [71]:
pd.merge(df1, prova, right_on='employee_x', left_on='employee')

  employee      group_x employee_x      group_y employee_y  hire_date
0      Bob   Accounting        Bob   Accounting       Lisa       2004
1     Jake  Engineering       Jake  Engineering        Bob       2008
2     Lisa  Engineering       Lisa  Engineering       Jake       2012
3      Sue           HR        Sue           HR        Sue       2014